tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

tap "mas-cli/tap"
brew "mas-cli/tap/mas"

# Utils
cask "appcleaner"
cask "caffeine"
cask "drawio"
cask "gpg-suite-no-mail"
cask "keka"
cask "linearmouse"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "vlc"
tap "jakehilborn/jakehilborn"
brew "jakehilborn/jakehilborn/displayplacer"

# Terminal
cask "kitty"
brew "fish"
brew "fisher" # fish plugin manager
cask "font-fira-code"
cask "font-fira-code-nerd-font"
brew "jq"
brew "yq"
brew "nmap"
cask "zenmap"
brew "neofetch"   # neofetch for mac
brew "dos2unix"   # dos2unix for mac
brew "fzf"        # fuzzy finder         https://github.com/junegunn/fzf#usage
brew "arping"     # arp ping             https://github.com/ThomasHabets/arping
brew "diskonaut"  # tui disk navigator   https://github.com/imsnif/diskonaut
brew "bat"        # better cat           https://github.com/sharkdp/bat
brew "bottom"     # better top           https://github.com/ClementTsang/bottom
brew "eza"        # better ls            https://github.com/eza-community/eza
brew "fd"         # better find          https://github.com/sharkdp/fd
brew "git-delta"  # better git diff      https://github.com/dandavison/delta
brew "trippy"     # better traceroute    https://github.com/fujiapple852/trippy
brew "viddy"      # better watch         https://github.com/sachaos/viddy
brew "zoxide"     # better cd            https://github.com/ajeetdsouza/zoxide

# Dev
brew "go"
brew "just"
brew "gh"
brew "pyenv"
brew "kubectl"
brew "kustomize"
brew "helm"
brew "kubectx"
brew "go-jsonnet"
brew "jsonnet-bundler"
cask "monodraw"
cask "db-browser-for-sqlite"
cask "openlens" # add `@alebcay/openlens-node-pod-menu`
cask "visual-studio-code"
cask "fork"
cask "wireshark"
brew "wireshark"
brew "tfenv"
brew "node"
brew "terraformer"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"

# VSCode
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "Grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "kokakiwi.vscode-just"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "stkb.rewrap"
vscode "zhuangtongfa.material-theme"

if ! system "ls /Library/LaunchAgents/ | grep paloaltonetworks"

    # Personal
    cask "firefox"
    cask "discord"
    cask "plex"
    brew "tailscale"
    cask "orbstack"
    cask "slack"
    mas "Wireguard", id: 1451685025

    # Personal/Talos
    tap "siderolabs/talos"
    tap "dopplerhq/cli"
    brew "siderolabs/talos/talosctl"
    brew "talhelper"
    brew "gnupg" # for doppler
    brew "dopplerhq/cli/doppler"
    brew "liqoctl"

    # Personal/Monitoring
    brew "node_exporter" unless system "ioreg -c AppleSmartBattery -r | grep '\"BatteryInstalled\" = Yes'"

    # Personal/VSCode
    vscode "WakaTime.vscode-wakatime"

else

    brew "azure-cli"
    tap "azure/kubelogin"
    brew "azure/kubelogin/kubelogin"

    tap "cloudfoundry/tap"
    brew "cloudfoundry/tap/cf-cli@8"

    tap "fluxcd/tap"
    brew "fluxcd/tap/flux"
    brew "sops"

end
