tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

tap "mas-cli/tap"
brew "mas-cli/tap/mas"

# Utils
cask "appcleaner"
cask "caffeine"
cask "drawio"
cask "gpg-suite-no-mail"
cask "keka"
cask "linearmouse"
cask "obsidian"
cask "rectangle"
cask "vlc"
tap "jakehilborn/jakehilborn"
brew "jakehilborn/jakehilborn/displayplacer"
brew "imagemagick"

# Terminal
cask "kitty"
brew "fish"
brew "fisher" # fish plugin manager
tap "go-task/tap"
brew "go-task/tap/go-task"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
brew "jq"
brew "yq"
brew "nmap"
brew "neofetch"   # neofetch for mac
brew "dos2unix"   # dos2unix for mac
brew "tree"       # tree for mac
brew "fzf"        # fuzzy finder         https://github.com/junegunn/fzf#usage
brew "arping"     # arp ping             https://github.com/ThomasHabets/arping
brew "diskonaut"  # tui disk navigator   https://github.com/imsnif/diskonaut
brew "bat"        # better cat           https://github.com/sharkdp/bat
brew "bottom"     # better top           https://github.com/ClementTsang/bottom
brew "eza"        # better ls            https://github.com/eza-community/eza
brew "fd"         # better find          https://github.com/sharkdp/fd
brew "git-delta"  # better git diff      https://github.com/dandavison/delta
brew "trippy"     # better traceroute    https://github.com/fujiapple852/trippy
brew "viddy"      # better watch         https://github.com/sachaos/viddy
brew "zoxide"     # better cd            https://github.com/ajeetdsouza/zoxide
brew "ripgrep"    # better grep          https://github.com/BurntSushi/ripgrep

# Dev
brew "go"
brew "gh"
brew "kubectl"
tap "kubecolor/tap"
brew "kubecolor/tap/kubecolor"
brew "kustomize"
brew "helm"
brew "kubectx"
tap "derailed/k9s"
brew "derailed/k9s/k9s"
cask "monodraw"
cask "db-browser-for-sqlite"
cask "openlens" # add `@alebcay/openlens-node-pod-menu`
cask "visual-studio-code"
cask "fork"
cask "wireshark"
brew "wireshark"
brew "node"
brew "python@3.12"
tap "kcl-lang/tap"
brew "kcl-lang/tap/kcl"
brew "kcl-lang/tap/kcl-lsp"

# VSCode
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "Grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "kcl.kcl-vscode-extension"
vscode "kokakiwi.vscode-just"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "task.vscode-task"
vscode "zhuangtongfa.material-theme"

if ! system "ls /Library/LaunchAgents/ | grep paloaltonetworks"

    # Personal
    cask "firefox"
    cask "discord"
    cask "plex"
    cask "orbstack"
    cask "slack"
    mas "Wireguard", id: 1451685025

    # Personal/Monitoring
    brew "node_exporter" unless system "ioreg -c AppleSmartBattery -r | grep '\"BatteryInstalled\" = Yes'"

    # Personal/VSCode
    vscode "WakaTime.vscode-wakatime"

else

    brew "azure-cli"
    tap "azure/kubelogin"
    brew "azure/kubelogin/kubelogin"

    tap "cloudfoundry/tap"
    brew "cloudfoundry/tap/cf-cli@8"

    tap "fluxcd/tap"
    brew "fluxcd/tap/flux"

end
